app/views/books/_form.html.haml

    = f.label :author
    = f.collection_select(:author_id, Author.all,:id,:name,{}, :multiple =>false)
  .field
    = f.label :library
    = f.collection_select(:library_id, Library.all,:id,:name,{}, :multiple =>false)
  .field
---
SELECT "authors".* FROM "authors"
SELECT "libraries".* FROM "libraries"