app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "dob", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Marios"], ["dob", "2018-11-22"], ["created_at", "2018-11-22 00:30:08.688243"], ["updated_at", "2018-11-22 00:30:08.688243"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

UPDATE "authors" SET "dob" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["dob", "2013-01-01"], ["updated_at", "2018-11-22 00:30:24.154484"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)