app/controllers/books_controller.rb

INSERT INTO "books" ("author_id", "library_id", "title", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author_id", 1], ["library_id", 1], ["title", "book"], ["genre", "genre"], ["created_at", "2018-12-09 16:51:20.667005"], ["updated_at", "2018-12-09 16:51:20.667005"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."name" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find(params[:id])
      @author =Author.find(@book.author_id).name
      @library = Library.find(@book.library_id).name