app/controllers/libraries_controller.rb

  def create
    @library = Library.new(library_params)

    respond_to do |format|
      if @library.save
---
INSERT INTO "libraries" ("name", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Limassol"], ["active", 1], ["created_at", "2018-11-18 20:00:00.193427"], ["updated_at", "2018-11-18 20:00:00.193427"]]

  def update
    respond_to do |format|
      if @library.update(library_params)
---
UPDATE "libraries" SET "active" = ?, "updated_at" = ? WHERE "libraries"."id" = ?  [["active", 1], ["updated_at", "2018-12-09 17:05:14.987609"], ["id", 1]]

  def destroy
    @library.destroy
---
DELETE FROM "libraries" WHERE "libraries"."id" = ?  [["id", 1]]